---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Mechanical.DuctFittingAndAccessoryConnectorData
source: html/d864c874-8d8d-13d4-5de1-ad15b280252e.htm
---
# DuctFittingAndAccessoryConnectorData Members

Releases all resources used by the DuctFittingAndAccessoryConnectorData